In [2]:
import pandas as pd
import numpy as np

In [30]:
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                                            [1,2,3,1,3,1,2,2,3]])

In [31]:
data

a  1   -0.273144
   2   -0.194646
   3    0.211537
b  1    1.497027
   3   -1.075540
c  1    0.441225
   2   -1.365138
d  2   -0.428411
   3    1.581238
dtype: float64

In [32]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [33]:
data['b':'d']

b  1    1.497027
   3   -1.075540
c  1    0.441225
   2   -1.365138
d  2   -0.428411
   3    1.581238
dtype: float64

In [37]:
data.loc[['b','d'], :]

b  1    1.497027
   3   -1.075540
d  2   -0.428411
   3    1.581238
dtype: float64

In [11]:
data.loc[:, 2] ## selection is even possible from an "inner" level:

a   -0.308430
c    0.295166
d    0.150435
dtype: float64

Hierarchical indexing plays an important role in reshaping data and group-based operations like forming a pivot table. For Example, you colud rearrange the data into a DataFrame using its unstack method

In [13]:
data.unstack()

          1         2         3
a  0.297354 -0.308430  0.725022
b -0.936122       NaN  0.741358
c  0.878793  0.295166       NaN
d       NaN  0.150435 -2.463836

In [14]:
data.unstack().stack()

a  1    0.297354
   2   -0.308430
   3    0.725022
b  1   -0.936122
   3    0.741358
c  1    0.878793
   2    0.295166
d  2    0.150435
   3   -2.463836
dtype: float64

With a DataFrame, either axis can have a hierarchical index:

In [40]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     index = [['a','a','b','b'], [1,2,1,2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [41]:
frame.index.names =['key1', 'key2']

In [42]:
frame.columns.names = ['state', 'color']

In [43]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [44]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [27]:
MultiIndex.from_array([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], names=['state', 'color'])

NameError: name 'MultiIndex' is not defined

# Reordering and Sorting Levels

In [45]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [46]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [47]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

# Summary Statistics by Level

In [48]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [49]:
frame.sum(level='key1' )

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [50]:
frame.sum(level='key2' )

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [14]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [15]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

# Indexing With a DataFrame's columns

In [22]:
frame = pd.DataFrame({'a': range(7), 
                      'b': range(7, 0,-1),
                      'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                      'd': [0,1,2,0,1,2,3]})

In [23]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [25]:
frame2 = frame.set_index(['c', 'd'])

In [26]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [27]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [28]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1